Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [6]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [8]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [15]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [28]:
dic = { 'name' : ['alice' , 'Bob', 'Claire', 'sanju','nitya' ,'anshu', 'deepak', 'sneha', 'hitesh'], 'age': [25,30,27,23,24,67,56,45,54], 'gender': ['female','male', 'female','male','female','male','male','female','male']}

In [29]:
df1 = pd.DataFrame(dic)

In [30]:
df1

     name  age  gender
0   alice   25  female
1     Bob   30    male
2  Claire   27  female
3   sanju   23    male
4   nitya   24  female
5   anshu   67    male
6  deepak   56    male
7   sneha   45  female
8  hitesh   54    male

In [31]:
l = [1,3,5,7,9,11,13,15,17]

In [46]:
df1.index = l

In [47]:
df1

    age  gender
1    25  female
3    30    male
5    27  female
7    23    male
9    24  female
11   67    male
13   56    male
15   45  female
17   54    male

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [48]:
data = {'Values': [10, 20, 30, 40, 50]}

In [49]:
df = pd.DataFrame(data)

In [50]:
df

   Values
0      10
1      20
2      30
3      40
4      50

In [51]:
sum_three_value = df.head(3).sum()

In [52]:
sum_three_value

Values    60
dtype: int64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [78]:
data = {'Text': ['datascience' , 'data', 'dataengering', 'bigadata', 'dataAnalytcs']}

In [79]:
df = pd.DataFrame(data)

In [80]:
df

           Text
0   datascience
1          data
2  dataengering
3      bigadata
4  dataAnalytcs

In [98]:
p= []
for i in df['Text']:
    l = len(i)
    p.append(l)
print(p) 
df['Word_Count'] = p

[11, 4, 12, 8, 12]

In [99]:
df

           Text  Word_Count
0   datascience          11
1          data           4
2  dataengering          12
3      bigadata           8
4  dataAnalytcs          12

Q5. How are DataFrame.size() and DataFrame.shape() different?

Ans: DataFrame.size gives the total number of elements in the DataFrame, which is equivalent to the total number of cells in the DataFrame, including both rows and columns.
DataFrame.shape returns a tuple representing the dimensions of the DataFrame, where the first element represents the number of rows and the second element represents the number of columns.

In [102]:
df.size

10

In [105]:
df.shape

(5, 2)

Q6. Which function of pandas do we use to read an excel file?

In [107]:
df3 = pd.read_excel('LUSID Excel - Setting up your market data.xlsx')

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [2]:
data = {'email': ['sanju@datascience.com' , 'harshu@data.com', 'harshit@dataengering.com', 'shivam@bigadata.com', 'nitya@dataAnalytcs.com']}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

                      email
0     sanju@datascience.com
1           harshu@data.com
2  harshit@dataengering.com
3       shivam@bigadata.com
4    nitya@dataAnalytcs.com

In [16]:
df['Username'] = df['email'].str.split('@').str[0]

In [17]:
df

                      email Username
0     sanju@datascience.com    sanju
1           harshu@data.com   harshu
2  harshit@dataengering.com  harshit
3       shivam@bigadata.com   shivam
4    nitya@dataAnalytcs.com    nitya

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [36]:
data = {'A': [3,8,6,2,9], 'B' : [5,2,9,3,1], 'C' : [1,7,4,5,2]}

In [37]:
df = pd.DataFrame(data)

In [38]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [39]:
df[(df["A"]>5) & (df["B"]<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [40]:
df1 = pd.DataFrame(df[(df["A"]>5) & (df["B"]<10)])

In [42]:
df1

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [43]:
data = {'Values': [10, 20, 30, 40, 50]}

In [44]:
df = pd.DataFrame(data)

In [45]:
df

   Values
0      10
1      20
2      30
3      40
4      50

In [46]:
df.describe()

          Values
count   5.000000
mean   30.000000
std    15.811388
min    10.000000
25%    20.000000
50%    30.000000
75%    40.000000
max    50.000000

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [3]:
data = {
    'Date': pd.date_range(start='2023-08-01', periods=10, freq='D'),
    'Sales': [100, 120, 90, 110, 130, 140, 150, 120, 100, 110]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

        Date  Sales
0 2023-08-01    100
1 2023-08-02    120
2 2023-08-03     90
3 2023-08-04    110
4 2023-08-05    130
5 2023-08-06    140
6 2023-08-07    150
7 2023-08-08    120
8 2023-08-09    100
9 2023-08-10    110

In [21]:
df = df.sort_values(by='Date')

In [22]:
df

   index       Date  Sales
0      0 2023-08-01    100
1      1 2023-08-02    120
2      2 2023-08-03     90
3      3 2023-08-04    110
4      4 2023-08-05    130
5      5 2023-08-06    140
6      6 2023-08-07    150
7      7 2023-08-08    120
8      8 2023-08-09    100
9      9 2023-08-10    110

In [28]:
df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()

In [29]:
df

   index       Date  Sales  MovingAverage
0      0 2023-08-01    100     100.000000
1      1 2023-08-02    120     110.000000
2      2 2023-08-03     90     103.333333
3      3 2023-08-04    110     105.000000
4      4 2023-08-05    130     110.000000
5      5 2023-08-06    140     115.000000
6      6 2023-08-07    150     120.000000
7      7 2023-08-08    120     122.857143
8      8 2023-08-09    100     120.000000
9      9 2023-08-10    110     122.857143

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [40]:
data = {
    'Date': pd.date_range(start='2023-08-01', periods=10)}

In [41]:
df = pd.DataFrame(data)

In [42]:
df

        Date
0 2023-08-01
1 2023-08-02
2 2023-08-03
3 2023-08-04
4 2023-08-05
5 2023-08-06
6 2023-08-07
7 2023-08-08
8 2023-08-09
9 2023-08-10

In [43]:
df['Date'] = pd.to_datetime(df['Date'])

In [48]:
 df['Weekday'] = df['Date'].dt.strftime('%A')

In [49]:
df

        Date    Weekday
0 2023-08-01    Tuesday
1 2023-08-02  Wednesday
2 2023-08-03   Thursday
3 2023-08-04     Friday
4 2023-08-05   Saturday
5 2023-08-06     Sunday
6 2023-08-07     Monday
7 2023-08-08    Tuesday
8 2023-08-09  Wednesday
9 2023-08-10   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [53]:
data = {
    'Date': pd.date_range(start='2023-01-01', end = '2023-01-31' )}

In [54]:
df = pd.DataFrame(data)

In [56]:
df['Date'] = pd.to_datetime(df['Date'])

In [57]:
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [58]:
import pandas as pd